tutorials/snowAroundBuilding/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

motionSolverLibs (fvMotionSolvers);

motionSolver velocityLaplacian;   //displacementLaplacian;
//motionSolver velocityComponentLaplacian z;
//
// diffusivity  uniform;
// diffusivity  directional (0 0 100);
//diffusivity  motionDirectional (0 0 100);
// diffusivity  file motionDiffusivity;
diffusivity  quadratic inverseDistance 3(bottom.snow roof top);

// ************************************************************************* //
