tutorials/snowAroundBuilding/system/controlDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Make sure all utilities know specialised models
libs            (atmosphericModels);

application     driftScalarDyFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         END_TIME;

deltaT          DELTA_TIME;

writeControl    timeStep;

writeInterval   WRITE_INTERVAL;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

functions
{
    INCLUDE //    #include "wallShearStress"
}


// ************************************************************************* //
